"give_4"
"low_rating"
"blew_away"
"but_not_much"
"distasteful"
"negative_comments"
"stopped_watching"
"isn't_for"
"looks_as_if"
"lost_interest"
"back_enjoy"
"grade_b"
"not_in_good"
"this_travesty"
"every_time_watch"
"not_disappointed"
"gently"
"wanting_more"
"bad_reviews"
"little_else"
"midget"
"of_justice"
"only_reason_to"
"so_disappointed"
"this_junk"
"7.5"
"just_enjoy"
"little_slow"
"might_enjoy"
"revolting"
"entertains"
"that_most_people"
"total_lack"
"watched_again"
"if_must"
"spinal_tap"
"still_this"
"blown_up"
"email"
"marvellous"
"only_complaint"
"vapid"
"even_close_to"
"lot_of_things"
"on_plus_side"
"penalty"
"this_fun"
"unappealing"
"1_2_from"
"in_grave"
"not_typical"
"dvd_cover"
"or_hate"
"than_many"
"what_point_of"
"fine_film"
"let's_see"
"motions"
"something_better"
"liberty"
"only_saving"
"deliciously"
"ladder"
"about_time"
"or_dvd"
"segal"
"get_copy"
"this_very_good"
"fun_film"
"stereotyped"
"anyone_interested"
"grade_d"
"just_did"
"walking_around"
"absorbing"
"excellently"
"neatly"
"had_high"
"cerebral"
"letdown"
"very_moving"
"what_exactly"
"detract"
"hepburn"
"must_for"
"there_some_good"
"for_actors"
"importance_of"
"who_made_this"
"embarrassingly"
"glad_did"
"won't_be_disappointed"
"delicious"
"flimsy"
"how_not_to"
"looks_at"
"wider"
"bela_lugosi"
"than_expected"
"maybe_if"
"if_director"
"little_movie"
"departure"
"lot_about"
"this_fine"
"definitely_recommend"
"in_u.s"
"predictable_but"
"few_laughs"
"steals_show"
"tolerable"
"blatantly"
"fortunate"
"glued"
"able_to_see"
"wanted_to_like"
"not_recommended"
"wouldn't_recommend"
"dirty_harry"
"energetic"
"how_not"
"very_slow"
"paramount"
"simply_not"
"one_star"
"just_wasn't"
"watch_over"
"surprisingly_good"
"mystery_science"
"wrenching"
"lifeless"
"time_watch"
"at_it's"
"only_problem"
"voodoo"
"be_comedy"
"okay_but"
"fell_asleep"
"restored"
"thumbs_up"
"below_average"
"christians"
"favorite_movies"
"if_don't_like"
"been_fan"
"hackneyed"
"main_problem"
"sure_it's"
"would_be_good"
"just_great"
"unfold"
"unlikeable"
"9_out_of_10"
"ape"
"bothered_to"
"yawn"
"can_relate"
"joy_to"
"this_turkey"
"olds"
"see_any"
"what_thinking"
"be_missed"
"muddled"
"of_laughs"
"polished"
"complaints"
"very_real"
"check_this"
"save_money"
"that_funny"
"more_movies"
"simplicity"
"what_point"
"bravo"
"jackass"
"in_lives"
"cash_in"
"spot_on"
"doesn't_help"
"i'm_afraid"
"for_once"
"just_seems"
"mason"
"3_out_of_10"
"travesty"
"facing"
"isn't_much"
"isn't_very"
"may_seem"
"story_told"
"2_out_of_10"
"tiresome"
"cleverly"
"very_enjoyable"
"sit_back"
"at_times_but"
"inappropriate"
"sub_par"
"careful"
"8_out_of"
"understated"
"look_forward"
"8_out"
"embarrassment"
"every_day"
"not_very_good"
"any_of_characters"
"been_great"
"bad_thing"
"stock_footage"
"based_on_true_story"
"4_out_of_10"
"riveting"
"stilted"
"baldwin"
"for_free"
"tripe"
"just_isn't"
"downhill"
"7_out_of"
"don't_miss"
"very_disappointed"
"7_out"
"outer_space"
"rip_off_of"
"then_will"
"ideal"
"only_good_thing"
"shelf"
"just_right"
"splendid"
"unintentional"
"should_never"
"pleasantly_surprised"
"sadistic"
"little_film"
"on_edge_of"
"strictly"
"complain"
"draws"
"can't_wait"
"from_original"
"synopsis"
"this_excellent"
"first_rate"
"too_seriously"
"worthless"
"1_out"
"fast_paced"
"skip_this"
"interesting_but"
"not_recommend"
"don't_believe"
"fears"
"disjointed"
"lot_of_fun"
"worlds"
"unwatchable"
"flawless"
"of_funniest"
"should_see"
"stinker"
"walked_out"
"superbly"
"horrid"
"how_good"
"10_out_of_10"
"drivel"
"pleased"
"timeless"
"one_of_better"
"insulting"
"that's_about"
"save_this"
"unintentionally"
"this_mess"
"of_seat"
"would_love_to"
"10_out"
"isn't_even"
"definite"
"essential"
"incoherent"
"eerie"
"highly_recommend_this"
"2_10"
"appalling"
"bible"
"too_hard"
"in_cast"
"trite"
"cried"
"premise_of"
"tries_to_be"
"cardboard"
"to_recommend"
"brazil"
"hype"
"annoyed"
"even_that"
"without_being"
"insult_to"
"doesn't_work"
"miscast"
"unforgettable"
"very_different"
"lacked"
"courage"
"consequences"
"marvelous"
"perfection"
"definitely_worth"
"power_of"
"stick_to"
"uninspired"
"troubled"
"did_this"
"even_better"
"very_entertaining"
"hooked"
"this_best"
"can_watch"
"boredom"
"bugs"
"fast_forward"
"existent"
"idiotic"
"carries"
"credibility"
"embarrassed"
"wasting"
"absolutely_nothing"
"gripping"
"2_out"
"best_part"
"chilling"
"exceptional"
"lazy"
"this_crap"
"see_again"
"ashamed"
"dollar"
"raw"
"might_not"
"not_one_of"
"again_again"
"inept"
"ludicrous"
"mst3k"
"looking_forward"
"packed"
"paint"
"stupidity"
"let_down"
"thought_provoking"
"to_work_with"
"fabulous"
"obnoxious"
"screenwriter"
"touched"
"succeeds"
"uninteresting"
"1_10"
"deeper"
"not_make"
"performances_by"
"9_10"
"3_10"
"unconvincing"
"much_better_than"
"nonetheless"
"would've"
"great_but"
"top_notch"
"bore"
"patient"
"sensitive"
"atrocious"
"than_any"
"stay_away"
"mildly"
"alright"
"no_other"
"urban"
"loved_this"
"forgettable"
"remotely"
"mainstream"
"gritty"
"just_doesn't"
"appreciated"
"touches"
"extraordinary"
"only_good"
"may_not_be"
"offensive"
"be_disappointed"
"junk"
"reason_for"
"seagal"
"haunting"
"refreshing"
"relate_to"
"satisfying"
"4_10"
"captures"
"just_too"
"favorites"
"going_for"
"if_want_to_see"
"just_didn't"
"like_watching"
"ruined"
"whole_film"
"would_recommend"
"propaganda"
"for_everyone"
"liked_this"
"promising"
"doesn't_make"
"this_thing"
"highly_recommended"
"might_been"
"doesn't_even"
"nevertheless"
"asleep"
"enjoyed_this"
"pleasant"
"research"
"traditional"
"insult"
"turkey"
"warm"
"7_10"
"work_in"
"amateurish"
"steals"
"subtitles"
"to_believe_that"
"embarrassing"
"endless"
"tedious"
"to_sit_through"
"freedom"
"8_10"
"recommend_to"
"horribly"
"this_good"
"very_bad"
"brilliantly"
"europe"
"failure"
"fill"
"ultimate"
"well_written"
"little_to"
"lousy"
"paper"
"those_of"
"two_hours"
"ages"
"rip_off"
"underrated"
"spectacular"
"avoid_this"
"shallow"
"unexpected"
"be_funny"
"great_job"
"through_this"
"this_piece_of"
"far_too"
"pretentious"
"delightful"
"dimensional"
"irritating"
"just_not"
"quiet"
"not_worth"
"unrealistic"
"some_sort_of"
"frankly"
"first_saw"
"of_war"
"attempt_at"
"dreadful"
"finest"
"unfunny"
"why_did"
"absolutely_no"
"bland"
"shots_of"
"sucked"
"well_worth"
"saving"
"so_well"
"not_funny"
"of_fun"
"unnecessary"
"worth_seeing"
"crappy"
"absurd"
"lacking"
"for_first_time"
"magnificent"
"this_piece"
"not_enough"
"10_10"
"about_as"
"not_good"
"remarkable"
"rubbish"
"friendship"
"nonsense"
"nicely"
"come_on"
"unusual"
"some_kind_of"
"brutal"
"make_movie"
"treat"
"below"
"don't_want"
"no_sense"
"surprising"
"don't_even"
"animal"
"wonderfully"
"highly_recommend"
"vhs"
"what_makes"
"sit_through"
"only_reason"
"read_book"
"care_about"
"tears"
"favourite"
"redeeming"
"be_good"
"scientist"
"seconds"
"pleasure"
"christian"
"watchable"
"b_movie"
"sucks"
"moved"
"thin"
"whatsoever"
"length"
"tragic"
"impact"
"deal_with"
"disaster"
"victims"
"good_job"
"as_much_as"
"way_too"
"good_film"
"start_to"
"wooden"
"supposedly"
"intense"
"cliché"
"adds"
"ugly"
"noir"
"delivers"
"some_good"
"this_great"
"lacks"
"mediocre"
"if_don't"
"paid"
"impressed"
"not_very"
"not_much"
"fresh"
"funniest"
"jean"
"compelling"
"dreams"
"rented"
"world_of"
"very_little"
"performance_as"
"no_matter"
"gem"
"fascinating"
"confusing"
"worst_movie"
"very_funny"
"tired"
"side_of"
"stunning"
"really_good"
"not_one"
"disappointment"
"innocent"
"hoping"
"should_been"
"complex"
"or_something"
"emotions"
"outstanding"
"pass"
"suppose"
"excuse"
"if_had"
"this_just"
"may_not"
"painful"
"rare"
"ride"
"love_this"
"journey"
"touching"
"unbelievable"
"terrific"
"disappointing"
"laughable"
"nowhere"
"thank"
"to_help"
"subtle"
"charming"
"at_best"
"beautifully"
"edge"
"great_movie"
"to_all"
"this_very"
"available"
"surprisingly"
"shoot"
"effective"
"failed"
"honestly"
"thanks"
"bother"
"grade"
"accent"
"glad"
"twists"
"solid"
"barely"
"must_see"
"genius"
"if_this"
"positive"
"one_of_worst"
"80_s"
"follows"
"well_done"
"too_many"
"garbage"
"producers"
"pointless"
"if_want_to"
"neither"
"trash"
"awesome"
"pathetic"
"portrayal"
"sweet"
"only_thing"
"not_that"
"value"
"van"
"appreciate"
"sadly"
"recommended"
"plenty_of"
"in_way"
"to_believe"
"at_same"
"bored"
"than_this"
"potential"
"incredible"
"wrote"
"flat"
"movie_just"
"at_first"
"unlike"
"present"
"as_good"
"caught"
"just_as"
"for_those"
"back_in"
"pretty_good"
"brings"
"recently"
"fails"
"deserves"
"powerful"
"t"
"good_as"
"look_like"
"unique"
"result"
"wasted"
"perfectly"
"believe_that"
"joke"
"mess"
"writers"
"minutes_of"
"dumb"
"meets"
"keeps"
"society"
"memorable"
"beauty"
"of_worst"
"but_still"
"let's"
"none_of"
"masterpiece"
"badly"
"otherwise"
"superb"
"write"
"it's_just"
"season"
"unless"
"at_time"
"recommend_this"
"bunch_of"
"first_time"
"atmosphere"
"9"
"poorly"
"premise"
"material"
"lame"
"weak"
"film_in"
"believable"
"looks_like"
"appears"
"greatest"
"okay"
"8"
"tale"
"ways"
"realistic"
"if_want"
"so_bad"
"much_better"
"oscar"
"effort"
"easy"
"fantastic"
"avoid"
"tried"
"7"
"release"
"tells"
"rent"
"on_dvd"
"sorry"
"any_of"
"of_what"
"surprised"
"dull"
"future"
"would_been"
"very_well"
"all_in"
"apparently"
"moving"
"lack_of"
"enjoyable"
"not_even"
"jack"
"at_times"
"basically"
"episodes"
"predictable"
"attention"
"cheap"
"could_been"
"happy"
"as_if"
"relationship"
"one_of_best"
"silly"
"disappointed"
"ridiculous"
"reality"
"even_though"
"today"
"annoying"
"interest"
"that_would"
"attempt"
"saw_this"
"obvious"
"simple"
"wonder"
"save"
"watching_this"
"story_of"
"chance"
"strong"
"wouldn't"
"looked"
"crap"
"experience"
"coming"
"ok"
"hilarious"
"city"
"except"
"of_most"
"better_than"
"decent"
"sometimes"
"did_not"
"highly"
"of_best"
"tries"
"works"
"brilliant"
"very_good"
"favorite"
"heart"
"writing"
"enjoyed"
"fine"
"unfortunately"
"example"
"amazing"
"with_this"
"lives"
"horrible"
"4"
"guess"
"care"
"problem"
"become"
"seemed"
"supposed"
"oh"
"gives"
"waste"
"worse"
"entertaining"
"human"
"often"
"liked"
"couldn't"
"loved"
"small"
"perfect"
"episode"
"definitely"
"keep"
"mean"
"wonderful"
"women"
"sex"
"terrible"
"truly"
"camera"
"wrong"
"performances"
"either"
"awful"
"classic"
"recommend"
"stupid"
"low"
"but_this"
"3"
"death"
"enjoy"
"completely"
"boring"
"else"
"nice"
"poor"
"1"
"idea"
"later"
"left"
"at_all"
"takes"
"of_course"
"instead"
"war"
"beautiful"
"excellent"
"half"
"someone"
"together"
"job"
"looks"
"reason"
"wasn't"
"true"
"money"
"different"
"shows"
"book"
"maybe"
"trying"
"although"
"looking"
"dvd"
"especially"
"each"
"played"
"yet"
"performance"
"fun"
"worst"
"anything"
"family"
"2"
"feel"
"minutes"
"bit"
"script"
"least"
"own"
"original"
"always"
"interesting"
"may"
"to_make"
"times"
"music"
"series"
"both"
"seems"
"world"
"quite"
"again"
"new"
"director"
"lot"
"find"
"makes"
"nothing"
"years"
"didn't"
"thing"
"actors"
"watching"
"should"
"why"
"still"
"off"
"better"
"life"
"best"
"love"
"plot"
"acting"
"seen"
"think"
"any"
"could"
"make"
"one_of"
"most"
"don't"
"also"
"will"
"great"
"bad"
"well"
"can"
"only"
"to_be"
"see"
"would"
"even"
"time"
"no"
"more"
"very"
"good"
"it's"
"just"
"who"
