1_10
1_out
10_10
10_out
2_10
2_out
3_10
4_10
7_10
7_out
8_10
8_out
80_s
9_10
about_as
about_time
absolutely_no
absolutely_nothing
absorbing
absurd
accent
acting
actors
adds
again
again_again
ages
all_in
alright
also
although
always
amateurish
amazing
animal
annoyed
annoying
any
anyone_interested
anything
ape
appalling
apparently
appears
appreciate
appreciated
as_good
as_if
ashamed
asleep
at_all
at_best
at_first
at_it's
at_same
at_time
at_times
at_times_but
atmosphere
atrocious
attempt
attempt_at
attention
available
avoid
avoid_this
awesome
awful
b_movie
back_enjoy
back_in
bad
bad_reviews
bad_thing
badly
baldwin
barely
basically
be_comedy
be_disappointed
be_funny
be_good
be_missed
beautiful
beautifully
beauty
become
been_fan
been_great
bela_lugosi
believable
believe_that
below
below_average
best
best_part
better
better_than
bible
bit
bland
blatantly
blew_away
blown_up
book
bore
bored
boredom
boring
both
bother
bothered_to
bravo
brazil
brilliant
brilliantly
brings
brutal
bugs
bunch_of
but_still
but_this
camera
can
can_relate
can_watch
can't_wait
captures
cardboard
care
care_about
careful
carries
cash_in
caught
cerebral
chance
charming
cheap
check_this
chilling
christian
christians
city
classic
cleverly
clich√©
come_on
coming
compelling
complain
complaints
completely
complex
confusing
consequences
could
could_been
couldn't
courage
crap
crappy
credibility
cried
deal_with
death
decent
deeper
definite
definitely
definitely_recommend
definitely_worth
delicious
deliciously
delightful
delivers
departure
deserves
detract
did_not
did_this
didn't
different
dimensional
director
dirty_harry
disappointed
disappointing
disappointment
disaster
disjointed
distasteful
doesn't_even
doesn't_help
doesn't_make
doesn't_work
dollar
don't
don't_believe
don't_even
don't_miss
don't_want
downhill
draws
dreadful
dreams
drivel
dull
dumb
dvd
dvd_cover
each
easy
edge
eerie
effective
effort
either
else
email
embarrassed
embarrassing
embarrassingly
embarrassment
emotions
endless
energetic
enjoy
enjoyable
enjoyed
enjoyed_this
entertaining
entertains
episode
episodes
especially
essential
europe
even
even_better
even_close_to
even_that
even_though
every_day
example
excellent
excellently
except
exceptional
excuse
existent
experience
extraordinary
fabulous
facing
failed
fails
failure
family
fantastic
far_too
fascinating
fast_forward
fast_paced
favorite
favorite_movies
favorites
favourite
fears
feel
fell_asleep
few_laughs
fill
film_in
find
fine
fine_film
finest
first_rate
first_saw
first_time
flat
flawless
flimsy
follows
for_actors
for_everyone
for_free
for_once
for_those
forgettable
fortunate
frankly
freedom
fresh
friendship
from_original
fun
fun_film
funniest
future
garbage
gem
genius
gently
get_copy
give_4
gives
glad
glued
going_for
good
good_as
good_film
good_job
grade
grade_b
grade_d
great
great_but
great_job
great_movie
greatest
gripping
gritty
guess
hackneyed
had_high
half
happy
haunting
heart
hepburn
highly
highly_recommend
highly_recommended
hilarious
honestly
hooked
hoping
horrible
horribly
horrid
how_good
how_not
human
hype
i'm_afraid
idea
ideal
idiotic
if_director
if_don't
if_must
if_this
if_want
impact
importance_of
impressed
in_grave
in_lives
in_u.s
in_way
inappropriate
incoherent
incredible
inept
innocent
instead
insult
insult_to
insulting
intense
interest
interesting
interesting_but
irritating
isn't_even
isn't_for
isn't_much
isn't_very
it's
it's_just
jack
jackass
jean
job
joke
journey
joy_to
junk
just_as
just_did
just_didn't
just_doesn't
just_enjoy
just_great
just_isn't
just_not
just_right
just_seems
just_too
just_wasn't
keep
keeps
lack_of
lacked
lacking
lacks
ladder
lame
later
laughable
lazy
least
left
length
let_down
let's
let's_see
letdown
liberty
life
lifeless
like_watching
liked
liked_this
little_else
little_film
little_movie
little_slow
little_to
look_forward
look_like
looked
looking
looking_forward
looks
looks_as_if
looks_at
looks_like
lost_interest
lot_about
lot_of_fun
lousy
love
love_this
loved
loved_this
low
low_rating
ludicrous
magnificent
main_problem
mainstream
make
make_movie
makes
marvellous
marvelous
mason
masterpiece
material
may
may_not
may_seem
maybe
maybe_if
mean
mediocre
meets
memorable
mess
midget
might_enjoy
might_not
mildly
minutes
minutes_of
miscast
money
more
more_movies
most
motions
moved
movie_just
moving
mst3k
much_better
muddled
music
must_for
must_see
mystery_science
neatly
negative_comments
neither
nevertheless
new
nice
nicely
no
no_matter
no_other
no_sense
noir
none_of
nonetheless
nonsense
not_disappointed
not_enough
not_even
not_funny
not_good
not_make
not_much
not_one
not_recommend
not_recommended
not_that
not_typical
not_very
not_very_good
not_worth
nothing
nowhere
obnoxious
obvious
of_best
of_course
of_fun
of_funniest
of_justice
of_laughs
of_most
of_seat
of_war
of_what
of_worst
off
offensive
often
oh
ok
okay
okay_but
olds
on_dvd
on_edge_of
on_plus_side
one_of
one_of_best
one_of_better
one_of_worst
one_star
only
only_complaint
only_good
only_problem
only_reason
only_saving
only_thing
or_dvd
or_hate
or_something
original
oscar
otherwise
outer_space
outstanding
own
packed
paid
painful
paint
paper
paramount
pass
pathetic
patient
penalty
perfect
perfection
perfectly
performance
performance_as
performances
performances_by
played
pleasant
pleasantly_surprised
pleased
pleasure
plenty_of
plot
pointless
polished
poor
poorly
portrayal
positive
potential
power_of
powerful
predictable
predictable_but
premise
premise_of
present
pretentious
pretty_good
problem
producers
promising
propaganda
quiet
quite
rare
raw
read_book
realistic
reality
really_good
reason
reason_for
recently
recommend
recommend_this
recommend_to
recommended
redeeming
refreshing
relate_to
relationship
release
remarkable
remotely
rent
rented
research
restored
result
revolting
ride
ridiculous
rip_off
riveting
rubbish
ruined
sadistic
sadly
satisfying
save
save_money
save_this
saving
saw_this
scientist
screenwriter
script
seagal
season
seconds
see
see_again
see_any
seemed
seems
seen
segal
sensitive
series
sex
shallow
shelf
shoot
shots_of
should
should_been
should_never
should_see
shows
side_of
silly
simple
simplicity
simply_not
sit_back
sit_through
skip_this
small
so_bad
so_disappointed
so_well
society
solid
some_good
someone
something_better
sometimes
sorry
spectacular
spinal_tap
splendid
spot_on
start_to
stay_away
steals
steals_show
stereotyped
stick_to
still
still_this
stilted
stinker
stock_footage
stopped_watching
story_of
story_told
strictly
strong
stunning
stupid
stupidity
sub_par
subtitles
subtle
succeeds
sucked
sucks
superb
superbly
suppose
supposed
supposedly
sure_it's
surprised
surprising
surprisingly
surprisingly_good
sweet
synopsis
t
takes
tale
tears
tedious
tells
terrible
terrific
than_any
than_expected
than_many
than_this
thank
thanks
that_funny
that_most_people
that_would
that's_about
then_will
there_some_good
thin
thing
think
this_best
this_crap
this_excellent
this_fine
this_fun
this_good
this_great
this_junk
this_just
this_mess
this_piece
this_thing
this_travesty
this_turkey
this_very
this_very_good
those_of
thought_provoking
through_this
thumbs_up
time
time_watch
timeless
times
tired
tiresome
to_all
to_be
to_believe
to_help
to_make
to_recommend
to_sit_through
today
together
tolerable
too_hard
too_many
too_seriously
top_notch
total_lack
touched
touches
touching
traditional
tragic
trash
travesty
treat
tried
tries
tries_to_be
tripe
trite
troubled
truly
trying
turkey
twists
two_hours
ugly
ultimate
unappealing
unbelievable
unconvincing
underrated
understated
unexpected
unfold
unforgettable
unfortunately
unfunny
uninspired
unintentional
unintentionally
uninteresting
unique
unless
unlike
unlikeable
unnecessary
unrealistic
unusual
unwatchable
urban
value
van
vapid
very
very_bad
very_different
very_disappointed
very_enjoyable
very_entertaining
very_funny
very_good
very_little
very_moving
very_real
very_slow
very_well
vhs
victims
voodoo
walked_out
walking_around
wanted_to_like
wanting_more
war
warm
wasn't
waste
wasted
wasting
watch_over
watchable
watched_again
watching
watching_this
way_too
ways
weak
well
well_done
well_worth
well_written
what_exactly
what_makes
what_point
what_thinking
whatsoever
who
who_made_this
whole_film
why
why_did
wider
will
with_this
without_being
women
won't_be_disappointed
wonder
wonderful
wonderfully
wooden
work_in
works
world
world_of
worlds
worse
worst
worst_movie
worth_seeing
worthless
would
would_be_good
would_been
would_love_to
would_recommend
would've
wouldn't
wouldn't_recommend
wrenching
write
writers
writing
wrong
wrote
yawn
years
yet
genuine
witty
skip
hated
how_bad
clichés
waste_time
really_bad
bad_acting
bad_movie